#字典
a={'sd':123,55:788,20:"abcd",155:123}#注意：键名不可以重复，否则后面会给前面覆盖。
print(a)
'''#查询
print(a.get(20))# 查询 键名是20的数据值。结果显示的是abcd
print(a.get(31))# 查询 键名是31的数据值。结果显示的是none
print(a['sd'])# 查询 键名是sd的数据值。结果显示的是123
print(a['sda'])# 查询 键名是sda的数据值。结果报错
a[100]='hello'#添加 在字典中末尾增加数据
print(a)#结果 {'sd': 123, 55: 788, 20: 'abcd', 155: 123, 100: 'hello'}
a[55]=600#修改  将键名55的数据改为600
print(a)#结果 {'sd': 123, 55: 600, 20: 'abcd', 155: 123, 100: 'hello'}
del a['sd']#删除  删除键名为sd 的数据
print(a)结果  {55: 600, 20: 'abcd', 155: 123, 100: 'hello'}'''
for i in a:
    print(i,a[i])


